itcastEn5d/STM32_F103_Learn/Hardware/CountSensor.c
#include "stm32f10x.h"                  // Device header

uint16_t CountSensor_Count;
void CountSensor_Init(void)
{
	RCC_APB2PeriphClockCmd (RCC_APB2Periph_GPIOB,ENABLE );
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);//开启AFIO的时钟
	
GPIO_InitTypeDef GPIO_Structure;//配置初始化引脚
	GPIO_Structure.GPIO_Mode=GPIO_Mode_IPU;
	GPIO_Structure.GPIO_Pin=GPIO_Pin_14;
	GPIO_Structure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_Init(GPIOB,&GPIO_Structure);
	
	GPIO_EXTILineConfig (GPIO_PortSourceGPIOB,GPIO_PinSource14);//选择EXTI的中断信号源
	
	//EXTI初始化
	EXTI_InitTypeDef EXTI_InitStructure;
	EXTI_InitStructure.EXTI_Line=EXTI_Line14;
	EXTI_InitStructure.EXTI_LineCmd=ENABLE;
	EXTI_InitStructure.EXTI_Mode=EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger=EXTI_Trigger_Falling;
	EXTI_Init(&EXTI_InitStructure);
	
	//NVIC分组
	NVIC_PriorityGroupConfig (NVIC_PriorityGroup_2);
	
	//NVIC配置
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel=EXTI15_10_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd= ENABLE;//使能中断
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority=1;//
	NVIC_InitStructure.NVIC_IRQChannelSubPriority=1;
	NVIC_Init(&NVIC_InitStructure);
}

uint16_t CountSensor_Get(void)
{
	return CountSensor_Count;
	
}

void EXTI15_10_IRQHandler(void)
{
	if(EXTI_GetITStatus(EXTI_Line14)==SET){
		/*如果出现数据乱跳的现象，可再次判断引脚电平，以避免抖动*/
		if(GPIO_ReadInputDataBit(GPIOB,GPIO_Pin_14)==0)
		{
					CountSensor_Count++;
		}
	}
	
			EXTI_ClearITPendingBit (EXTI_Line14);

	
}